app/controllers/attendances_controller.rb

  def update
    @user = User.find(params[:user_id])
    @attendance = Attendance.find(params[:id])
    # 出勤時間が未登録であることを判定します。
    if @attendance.started_at.nil?
      if @attendance.update_attributes(started_at: Time.current.change(sec: 0))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
UPDATE "attendances" SET "finished_at" = ?, "updated_at" = ? WHERE "attendances"."id" = ?  [["finished_at", "2019-07-28 07:28:00"], ["updated_at", "2019-07-28 07:28:41.980200"], ["id", 24]]

  def update_one_month
    ActiveRecord::Base.transaction do # トランザクションを開始します。
      attendances_params.each do |id, item|
        attendance = Attendance.find(id)
        attendance.update_attributes!(item)
---
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "attendances" SET "started_at" = ?, "finished_at" = ?, "note" = ?, "updated_at" = ? WHERE "attendances"."id" = ?  [["started_at", "2019-08-18 00:00:00"], ["finished_at", "2019-08-18 09:00:00"], ["note", ""], ["updated_at", "2019-08-18 13:24:07.254188"], ["id", 1]]