app/controllers/users_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$sz26CDUkH/wg36CoIC9X2.R05N22hG4p2e3TZ0Pys0l7VwtVP21Vm"], ["updated_at", "2019-06-27 22:08:15.686309"], ["id", 2]]
---
  def update
    if @user.update_attributes(user_params)

UPDATE "users" SET "department" = ?, "basic_time" = ?, "work_time" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["department", ""], ["basic_time", "2019-07-17 23:00:00"], ["work_time", "2019-07-17 22:30:00"], ["updated_at", "2019-07-17 15:09:31.175902"], ["id", 2]]
---
  def update_basic_info
    if @user.update_attributes(basic_info_params)